include/fedex/wsdl/DeleteShipmentRequest.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/ship/v8">
<SOAP-ENV:Body>
<DeleteShipmentRequest>
<WebAuthenticationDetail>
<UserCredential>
<Key></Key>
<Password></Password>
</UserCredential>
</WebAuthenticationDetail>
<ClientDetail>
<AccountNumber></AccountNumber>
<MeterNumber></MeterNumber>
</ClientDetail>
<TransactionDetail>
<CustomerTransactionId>DelteRequest</CustomerTransactionId>
</TransactionDetail>
<Version>
<ServiceId>ship</ServiceId>
<Major>8</Major>
<Intermediate>0</Intermediate>
<Minor>0</Minor>
</Version>
<ShipTimestamp>2010-03-16T09:30:47-05:00</ShipTimestamp>
<TrackingId>
<TrackingIdType>EXPRESS</TrackingIdType>
<FormId>String</FormId>
<TrackingNumber>794817814020</TrackingNumber>
</TrackingId>
<DeletionControl>DELETE_ALL_PACKAGES</DeletionControl>
</DeleteShipmentRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>